# presentation 2 - Variables

# Задача 4. Да се присвои стойност 3 на променлива ‘x’ и 
# стойност 10 на променлива наречена ‘y’. Да се запази стойността от x * y в отделна променлива,
# # която да се казва ‘result’. Накрая изходната информация трябва да изглежда:
# 3 + 10 = 30
x = 3
y = 10
result = x * y
print (f'{x}+{y}={result}')

# Задача 5. Да се изчисли лицето на триъгълник, 
# като неговата височина е 13.66, а срещуположната страна 245.54 см.
Height = float(13.66)
Lenght = float(245.54)
Area = round((Lenght * Height) / 2)
print (f'Лицето на триъгълника е приблизително: {Area}')

# Задача 6. Фирма, занимаваща се с маркетинг, иска да пази запис с данни на нейните служители. 
# Всеки запис трябва да има следната характе­ристика –
#  първо име, фамилия, възраст, пол (‘м’ или ‘ж’) 
# и уникален номер на служителя (27560000 до 27569999). 
# Декларирайте необходи­мите променливи, 
# нужни за да се запази информацията за един служи­тел, 
# като използвате подходящи типове данни и описателни имена.
name = 'Иван'#version 1
surname = 'Иванов'
age = '25'
gender = 'м'
special_Id = '27560000'
print (f'Име:{name}\nФамилия:{surname}\nГодини:{age}\nПол:{gender}\nНомер:{special_Id}')

# Задача 7. Декларирайте две променливи, които да са цели числа. 
# Задайте им стойности съответно 5 и 10. Разменете стойностите им и ги отпечатайте.
a = 5
b = 23
a, b = b, a
print(a,b)

# Задача 9. Да се пресметне питагоровата теорема 
# a2 + b2 = c2  при зададени променливи a, b и c от потребителя.
print ('Моля, въведете следната информация за да се изчисли Питагоровата теорема:')
a = int(input ('дължина 1: '))
b = int(input ('дължина 2: '))
c = round((a**2 + b**2)**0.5,2)
print (f'Резултат: {c}')

# Задача 10. Да се напише програма, която да пресмята лицето на кръг при зададен радиус r от потребителя.
print ('Моля, въведете радиус на кръга:')
a = int(input ('Радиус: '))
b = (3.14*(a**2))
print ((f'Лице: {b}'))

# Задача 11. Да се напише програма, която пресмята от inches в centimeters. 
# Един inches е 2.54 centimeters.
print ('Моля, въведете желаната дължина в инчове:')
a = int(input('Дължина:'))
b = round(a*2.54,2)
print (f'Резултат в инчове: {b}')


