# 8. Да се състави програма, която да отгатне колко е студено/топло по
# въведената температура в градус Целзий. Температурните интервали са: 
# t <=-20 ледено студено;
# t <=0 && t>-20 студено;
# t <=15 && t>0 хладно;
# t <=25 && t>15 топло;
# t >25 горещо
# Входни данни: t - цяло число от интервала [-100..100].
# Пример: 12 Изход: хладно

#personal note - в случая не знам дали трябва да ползвам \n вместо '''

t = int(input('''Моля, въведете температрата в градуси!
Задължително трябва да е между -100 и 100 градуса!
Темпереатура: '''))

if t < -100:
    print('''Зададената температура трябва 
да не бъде по-ниска от -100 градуса!.''')
    exit()
elif t > 100:
    print('''Зададената температура трябва 
да не бъде по-висока от 100 градуса!.''')
    exit()
elif t <=-20:
    print ('Ледено студено')
elif t <=0 and t >-20:
    print ('Студено') 
elif t <=15 and t >0:
    print ('Хладно')
elif t <=25 and t >15:
    print ('Топло')
else:
    print ('Горещо')