# Задача 1. Напишете програма, която чете цели числа въведени от потребителя и ги
# съхранява в списък. Програма трябва да продължи да чете стойности, докато
# потребителят не въведе 0. След това тя трябва да покаже всички стойности, въведени от
# потребителя (с изключение на 0), подредени от най-малката до най-голямата стойност,
# като на всеки ред се появява по една стойност. Използвайте или метода за сортиране,
# или функцията за сортиране на списъци

number_list = []
while True:
    user_number = int(input('Please type in a few numbers, to end press 0: ' ))
    if user_number == 0:
        break
    number_list.append(user_number)
    number_list.sort() #ползвах sort защото не прави копие на списъка, понеже няма нужда в случая.
for i in number_list:
    print(i)
