# 5. Да се състави програма, която да изчислява периметър и площ на
# правоъгълник по въведени дължини на прилежащи страни - естествени числа от
# интервала [5 ..100]. Изведете съобщение, ако страните формират квадрат.
# Използвайте проверка на логическо условие - оператор if.
# Пример: 4,4 Изход: квадрат лице 16, периметър

print ('''За да се изчислят периметъра и площта на правоъгълника,
моля въведете дължините на прилежащите му страни!
(Дължините трябва да бъдат между 5 и 100)''')

x1 = int(input('дължина 1 : '))
x2 = int(input('дължина 2 : '))

if x1<5 or x1>100:
    print('Дължина 1 не отговаря на изискванията')
if x2<5 or x2>100:
    print('Дължина 2 не отговаря на изискванията')
    exit()
if x1 == x2:
    print('\nКвадрат')

Perimeter = 2*(x1 + x2)
Area = x1 * x2
print(f'лице: {Area},',f'периметър: {Perimeter}.')