
# Задача 5. За да спечели най-голямата награда в определена лотария, човек трябва да
# съпостави всичките 6 числа от билета си с 6-те числа между 1 и 49, които са изтеглени от
# организатора на лотарията. Напишете програма, която генерира произволен избор от 6
# числа за лотариен билет. Уверете се, че избраните 6 числа не се повтарят. Покажете
# числата във възходящ ред

import random
lottery_number = random.sample(range(1,49),6)#had to learn about random.sample() function
lottery_number.sort()
for i in lottery_number:
    print(i)