# Задача 4. Да се създаде програма, която да чете цели числа въведени от потребителя,
# докато не бъде въведен празен ред. След като всичките числа са прочетени, програмата
# трябва да показва всички отрицателни числа, последвани от нули, последвани от всички
# положителни числа. Във всяка група номерата трябва да се показват в същия ред, в
# който са въведени от потребителя. Например, ако потребителят въведе стойностите 3, -
# 4, 1, 0, -1, 0 и -2, вашата програма трябва да изведе стойностите -4, -1, -2, 0, 0, 3 и 1 .
# Вашата програма трябва да показва всяка стойност на нов ред.

numbers_list = []
while True:
    user_number = input('Please enter a number, press Enter after entering all desired numbers: ' )
    if user_number == '':
        break
    user_number = int(user_number) 
    numbers_list.append(user_number)
    numbers_list.sort()
for i in numbers_list:
    print(i)